Workflow final design
Signed-off-by: marcopiraccini <marco.piraccini@gmail.com>
